ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/drivers/source/cy_seglcd.c
const cy_stc_seglcd_font_t cy_segLCD_5x8DmFont =
{
    .first   = ' ',
    .last    = '~',
    .ascii   = true,
    .fontMap = (uint8_t*)fontMap5x8
};


/*******************************************************************************
* Function Name: GetDataRegPtr
****************************************************************************//**
*
* Returns a pointer to the data frame register for a specified pixel.
* Used by \ref Cy_SegLCD_WritePixel and \ref Cy_SegLCD_ReadPixel functions.
*
* \param base  The base pointer to the LCD instance registers.
* \param pixel The predefined packed number that points to the pixel location
*              in the frame buffer.
*
*******************************************************************************/
static volatile uint32_t * GetDataRegPtr(LCD_Type * base, uint32_t pixel)
{
    volatile uint32_t * locDataPtr[] = {LCD_DATA0(base), LCD_DATA1(base), LCD_DATA2(base), LCD_DATA3(base)};

    return (&(locDataPtr[CY_SEGLCD_EXTR_COM(pixel) / CY_SEGLCD_NIBBLE][CY_SEGLCD_EXTR_OCT(pixel)]));
}


/*******************************************************************************
* Function Name: InvClrData
****************************************************************************//**
*
* Inverts or clears the Frame Data buffer.
* Used by \ref Cy_SegLCD_Deinit,
*         \ref Cy_SegLCD_ClrFrame and
*         \ref Cy_SegLCD_InvFrame functions.
*
* \param base  The base pointer to the LCD instance registers.
* \param inv:
*    - true - inverts the data buffer,
*    - false - clears the data buffer.
*
*******************************************************************************/
static void InvClrData(LCD_Type * base, bool inv)
{
    uint32_t i;

    for (i = 0UL; i < LCD_NUMPORTS; i++)
    {
        LCD_DATA0(base)[i] = (inv) ? (~LCD_DATA0(base)[i]) : 0UL;

        #if (0UL != LCD_NUMPORTS8)
            LCD_DATA1(base)[i] = (inv) ? (~LCD_DATA1(base)[i]) : 0UL;

            #if (0UL != LCD_NUMPORTS16)
                LCD_DATA2(base)[i] = (inv) ? (~LCD_DATA2(base)[i]) : 0UL;
                LCD_DATA3(base)[i] = (inv) ? (~LCD_DATA3(base)[i]) : 0UL;
            #endif /* LCD_NUMPORTS16 */
        #endif /* LCD_NUMPORTS8 */
    }
}


/*******************************************************************************
* Function Name: NumToChar
****************************************************************************//**
*
* Converts an one-digit hexadecimal numbers 0x0...0xF
* into the ASCII character codes.
* Used by the \ref Cy_SegLCD_WriteNumber function.
*
* \param value The value to be converted.
* \return The ASCII code of the 'value' character.
*
*******************************************************************************/
static char_t NumToChar(uint32_t value)
{
    uint32_t character;

    if (value < 10UL) /* For dec numbers 0...9 */
    {
        character = (uint32_t)'0' + value;
    }
    else if (value < 0x10UL) /* For hex numbers A...F */
    {
        character = ((uint32_t)'A' - 0xAUL) + value;
    }
    else
    {
        character = (uint32_t)' '; /* The blank/space character */
    }

    return ((char_t)character);
}


/*******************************************************************************
* Function Name: Cy_SegLCD_Init
****************************************************************************//**
*
* Initializes/restores the default Segment LCD block configuration.
*
* \param base   The base pointer to the LCD instance registers.
* \param config The pointer to a configuration structure.
* \return \ref cy_en_seglcd_status_t.
*
* Side Effects: The block is disabled to change the settings.
*
* \funcusage 
* \snippet seglcd/snippet/SegLCD_Snpt.c snippet_Cy_SegLCD_Config
* \snippet seglcd/snippet/SegLCD_Snpt.c snippet_Cy_SegLCD_Init
*
*******************************************************************************/
cy_en_seglcd_status_t Cy_SegLCD_Init(LCD_Type * base, cy_stc_seglcd_config_t const * config)
{
    cy_en_seglcd_status_t retVal = CY_SEGLCD_BAD_PARAM;
    
    if (NULL != base)
    {
        CY_ASSERT_L3(CY_SEGLCD_IS_SPEED_VALID(config->speed));
        CY_ASSERT_L3(CY_SEGLCD_IS_WAVE_VALID (config->wave));
        CY_ASSERT_L3(CY_SEGLCD_IS_DRIVE_VALID(config->drive));
        CY_ASSERT_L3(CY_SEGLCD_IS_BIAS_VALID (base, config->bias, config->speed));
        CY_ASSERT_L2(CY_SEGLCD_IS_LSCLK_VALID (config->lsClk));
        CY_ASSERT_L1(CY_SEGLCD_IS_COM_NUM_VALID(config->comNum));
        CY_ASSERT_L2(CY_SEGLCD_IS_RATE_VALID (config->frRate));
        CY_ASSERT_L2(CY_SEGLCD_IS_CNTR_VALID (config->contrast));
        CY_ASSERT_L2(CY_SEGLCD_IS_FREQ_VALID (config->clkFreq));

        uint32_t locCheck = ((CY_SEGLCD_SPEED_LOW == config->speed) && (CY_SEGLCD_REV_1(base))) ? (CY_SEGLCD_DIV_MAX_LS_VER1) : (CY_SEGLCD_DIV_MAX);
        uint32_t locSubfr = CY_SYSLIB_DIV_ROUND((CY_SYSLIB_DIV_ROUND(config->clkFreq, config->frRate * 4UL * config->comNum) - 1UL) * config->contrast, 100UL);
        uint32_t locDead = CY_SYSLIB_DIV_ROUND(CY_SYSLIB_DIV_ROUND(config->clkFreq * ((uint32_t)(100UL - (uint32_t)config->contrast)), (uint32_t)config->frRate), 100UL);
        
        if ((locSubfr <= locCheck) && (locDead <= locCheck))
        {
            uint32_t locLsClk = (uint32_t)((CY_SEGLCD_REV_1(base)) ? CY_SEGLCD_LSCLK_LF : config->lsClk);

            Cy_SegLCD_Disable(base);
            
            /* Calculate the sub-frame and dead-time dividers */
            LCD_DIVIDER(base) = _VAL2FLD(LCD_DIVIDER_SUBFR_DIV, locSubfr) |
                                _VAL2FLD(LCD_DIVIDER_DEAD_DIV,  locDead);

            /* Set the rest of settings */
            LCD_CONTROL(base) = _VAL2FLD(LCD_CONTROL_LCD_MODE, config->speed) |
                                _VAL2FLD(LCD_CONTROL_TYPE,     config->wave)  |
                                _VAL2FLD(LCD_CONTROL_OP_MODE,  config->drive) |
                                _VAL2FLD(LCD_CONTROL_BIAS,     config->bias)  |
                        _VAL2FLD(LCD_V2_CONTROL_CLOCK_LS_SEL,  locLsClk)      |
            /* Convert the comNum from the user range (2-16) into the machine range (0-14). */
                                _VAL2FLD(LCD_CONTROL_COM_NUM,  config->comNum - 2UL);

            retVal = CY_SEGLCD_SUCCESS;
        }
    }
    
    return (retVal);
}


